Repository: reteed/s3automatebackup
Catalog: s3automatebackup/Resources.*.resx
Languages: es

# RequiredFieldsMissing
source: Please complete all required fields.
es: Por favor, complete todos los campos requeridos.

source: Warning
es: Advertencia

# MissingInformation
source: Please complete all information before sending a test email.
es: Por favor, complete toda la información antes de enviar un correo de prueba.

# InvalidPort
source: Invalid SMTP port. Please enter a valid number.
es: Puerto SMTP inválido. Por favor, ingrese un número válido.

# SmtpTest
source: SMTP Test Email
es: Correo de Prueba SMTP

# SmtpTestMessage
source: This is a test email to verify SMTP settings.
es: Este es un correo de prueba para verificar la configuración de SMTP.

# SmtpSuccess
source: Test email sent successfully.
es: Correo de prueba enviado con éxito.

source: Success
es: Éxito

# SmtpFailure
source: The test email could not be sent.
es: No se pudo enviar el correo de prueba.

# MissingBucket
source: Please select a bucket before saving.
es: Por favor, seleccione un bucket antes de guardar.

# WarningTitle
source: Warning
es: Advertencia

# InvalidDateSelection
source: The selected date and time must be in the future.
es: La fecha y hora seleccionadas deben estar en el futuro.

# SelectPathType
source: Do you want to select a folder? (Yes = Folder, No = File)
es: ¿Desea seleccionar una carpeta? (Sí = Carpeta, No = Archivo)

# QuestionTitle
source: Question
es: Pregunta

# EncryptionCancelled
source: Encryption was cancelled.
es: Se canceló la encriptación.

# DeleteConfigurationConfirm
source: Are you sure you want to remove this setting?
es: ¿Está seguro de que desea eliminar esta configuración?

# ConfigurationInUse
source: This configuration is currently in use by a backup task.
es: Esta configuración está actualmente en uso por una tarea de respaldo.

# MissingConfigurations
source: Please create at least one configuration before creating a task.
es: Por favor, cree al menos una configuración antes de crear una tarea.

# DeleteTaskConfirm
source: Are you sure you want to delete this task?
es: ¿Está seguro de que desea eliminar esta tarea?

# DeletionCompleted
source: Removal completed successfully.
es: Eliminación completada con éxito.

# DeleteAllObjects
source: Are you sure you want to delete all the objects in the bucket?
es: ¿Está seguro de que desea eliminar todos los objetos en el bucket?

source: Confirm Deletion
es: Confirmar Eliminación

# DownloadCompleted
source: Download completed successfully.
es: Descarga completada con éxito.

# DecryptionFailed
source: The file could not be decrypted.
es: No se pudo descifrar el archivo.

# DecryptionCancelled
source: The decryption was canceled.
es: El descifrado fue cancelado.

source: Operation cancelled.
es: Operación cancelada.

# DownloadFailed
source: The file could not be downloaded.
es: No se pudo descargar el archivo.

source: Save file as
es: Guardar archivo como

# SelectValidVersion
source: Please select a valid version.
es: Por favor, seleccione una versión válida.

# ConfirmDeletionVersion
source: Are you sure you want to delete version {0} of object {1}?
es: ¿Está seguro de que desea eliminar la versión {0} del objeto {1}?

# VersionDeletedSuccess
source: Version {0} of object {1} was successfully deleted.
es: La versión {0} del objeto {1} fue eliminada con éxito.

source: Open
es: Abrir

source: Exit
es: Salir

# BackupSuccessMessage
source: Successful Backup for configuration {0} on bucket {1}.
es: Respaldo Exitoso para la configuración {0} en el bucket {1}.

# BackupSuccessSubject
source: S3AutomateBackup - Backup completed successfully.
es: S3AutomateBackup - Backup completado con éxito.

# BackupFailed
source: S3AutomateBackup - Backup failed.
es: S3AutomateBackup - El backup falló.

# BackupFailedBody
source: The backup failed for configuration {0} on bucket {1}. Reason: {2}.
es: El backup falló para la configuración {0} en el bucket {1}. Razón: {2}.

# RemoveOldFilesMessage
source: Successfully deleted old files and versions from bucket {0}.
es: Archivos antiguos y versiones eliminados con éxito del bucket {0}.

source: Invalid period key.
es: Clave de período inválida.

source: Sent to
es: Enviado a
