Repository: reteed/s3automatebackup
Catalog: s3automatebackup/Forms/CreateTaskForm.*.resx
Languages: es

# bucketNameLabel.Text
source: Bucket name:
es: Nombre del Bucket:

# backupPathLabel.Text
source: Backup folder/file path:
es: Ruta de la carpeta/archivo:

# scheduledTimeLabel.Text
source: Sheduled date and time:
es: Fecha y hora previstas:

# periodLabel.Text
source: Period:
es: Periodo:

# cancelButton.Text
source: Cancel
es: Cancelar

# saveButton.Text
source: Save
es: Guardar

# configurationLabel.Text
source: Configuration:
es: Configuración:

# additionalSettingsLabel.Text
source: Additional settings:
es: Ajustes adicionales:

# labelOldFiles.Text
source: days.
es: dias.

# browsePathButton.Text
source: Browse
es: Examinar

# encryptBackupCheckbox.Text
source: Encrypt Backup.
es: Encriptar Backup.

# MissingBucket
source: Please select a bucket.
es: Por favor, seleccione un bucket.

# InvalidDateSelection
source: Please select a date and time in the future.
es: Por favor, seleccione una fecha y hora en el futuro.

# RequiredFieldsMissing
source: Please fill in all the required fields before proceeding.
es: Por favor, complete todos los campos requeridos antes de continuar.

# SelectPathType
source: Do you want to select a folder? Click 'No' to select a file.
es: ¿Desea seleccionar una carpeta? Haga clic en 'No' para seleccionar un archivo.

# EncryptionCancelled
source: Encryption cancelled. Task will not be encrypted.
es: Cifrado cancelado. La tarea no será cifrada.

# SelectFolderTitle
source: Select the backup folder
es: Seleccione la carpeta de respaldo

# SelectFileTitle
source: Select the backup file
es: Seleccione el archivo de respaldo

# AllFilesFilter
source: All files (*.*)|*.*
es: Todos los archivos (*.*)|*.*

# WarningTitle
source: Warning
es: Advertencia

# QuestionTitle
source: Select Path Type
es: Seleccione el tipo de ruta
